In [25]:
import pandas as pd
dataset = pd.read_csv('data/meteorites.csv')

In [2]:
dataset.head()

,name,id,name_type,class,mass,fall,year,lat,long,geolocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [28]:
BigChonksIn1950 = dataset[(dataset['year']==1950) & (dataset['mass']>50000)]
BigChonksIn1950.head()

,name,id,name_type,class,mass,fall,year,lat,long,geolocation
5075,Belle Plaine,5004,Valid,L6,78800.0,Found,1950.0,37.31667,-97.25,"(37.31667, -97.25)"
37798,Tambo Quemado,23797,Valid,"Iron, IIIAB",141000.0,Found,1950.0,-14.66667,-74.50,"(-14.66667, -74.5)"